YoungSooBae1224/SensorShield-EVK-003-nRF52/BM1390GLV/mod/bm1390glv/bm1390glv_registers.h
/*
The MIT License (MIT)
Copyright (c) 2020 Rohm Semiconductor

Permission is hereby granted, free of charge, to any person obtaining a
copy of this software and associated documentation files (the
"Software"), to deal in the Software without restriction, including
without limitation the rights to use, copy, modify, merge, publish,
distribute, sublicense, and/or sell copies of the Software, and to
permit persons to whom the Software is furnished to do so, subject to
the following conditions:

The above copyright notice and this permission notice shall be included
in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#ifndef __BM1390GLV_REGISTERS_H__
#define __BM1390GLV_REGISTERS_H__
/* registers */
// [hPa]
#define BM1390GLV_COUNTS_PER_HPA 0x12C
// [Degree]
#define BM1390GLV_COUNTS_PER_DEGREE_CELSIUS 0x44C

#define BM1390GLV_REGISTER_DUMP_START 0x0F
#define BM1390GLV_MANUFACTURER_ID_REG 0x0F
#define BM1390GLV_PART_ID_REG 0x10
#define BM1390GLV_POWER_REG 0x12
#define BM1390GLV_RESET_REG 0x13
#define BM1390GLV_MODE_CONTROL_REG 0x14
#define BM1390GLV_IIR_FIFO_CONTROL_REG 0x15
#define BM1390GLV_FIFO_LEV_REG 0x18
#define BM1390GLV_STATUS_REG 0x19
// PRESS_OUT[15:5] integer part of pressure value
#define BM1390GLV_PRESSURE_OUT_MSB 0x1A
// PRESS_OUT[4:0] PRESS_OUT_XL[7:2] decimal part of pressure value
#define BM1390GLV_PRESSURE_OUT_LSB 0x1B
#define BM1390GLV_PRESSURE_OUT_DECIMAL 0x1C
// TEMP_OUT: [15] sign ; [14:5] integer ; [4:0] decimal (2's complement numbers)
#define BM1390GLV_TEMPERATURE_OUT_MSB 0x1D
// Temperature value [C]= TEMP_OUT[15:0]/32
#define BM1390GLV_TEMPERATURE_OUT_LSB 0x1E
#define BM1390GLV_REGISTER_DUMP_END 0x1E


/* registers bits */
#define BM1390GLV_ID1_REG_MANUFACTURER_ID1 (0xE0 << 0)
#define BM1390GLV_ID2_REG_MANUFACTURER_ID2 (0x34 << 0)

#define BM1390GLV_POWER_REG_RESERVED_WRITE0 (0x00 << 1)
#define BM1390GLV_POWER_REG_POWER_DOWN (0x00 << 0)
#define BM1390GLV_POWER_REG_POWER_UP (0x01 << 0)

#define BM1390GLV_RESET_REG_RESERVED_WRITE0 (0x00 << 1)
#define BM1390GLV_RESET_REG_MODE_RESET (0x00 << 0)
#define BM1390GLV_RESET_REG_MODE_STANDBY (0x01 << 0)

#define BM1390GLV_MODE_CONTROL_REG_AVE_NUM_AVG_8  (0x03 << 5)
#define BM1390GLV_MODE_CONTROL_REG_AVE_NUM_AVG_16 (0x04 << 5)
#define BM1390GLV_MODE_CONTROL_REG_AVE_NUM_AVG_32 (0x05 << 5)
#define BM1390GLV_MODE_CONTROL_REG_AVE_NUM_AVG_64 (0x06 << 5)

#define BM1390GLV_MODE_CONTROL_REG_DRDY_DISABLED (0x00 << 4)
#define BM1390GLV_MODE_CONTROL_REG_DRDY_ENABLED (0x01 << 4)

#define BM1390GLV_MODE_CONTROL_REG_FULL_DRDY_DISABLED (0x00 << 3)
#define BM1390GLV_MODE_CONTROL_REG_FULL_DRDY_ENABLED (0x01 << 3)

#define BM1390GLV_MODE_CONTROL_REG_WTM_DRDY_DISABLED (0x00 << 2)
#define BM1390GLV_MODE_CONTROL_REG_WTM_DRDY_ENABLED (0x01 << 2)

#define BM1390GLV_MODE_CONTROL_REG_MODE_STANDBY (0x00 << 0)
#define BM1390GLV_MODE_CONTROL_REG_MODE_ONE_SHOT (0x01 << 0)
#define BM1390GLV_MODE_CONTROL_REG_MODE_CONTINUOUS (0x02 << 0)
#define BM1390GLV_MODE_CONTROL_REG_MODE_PROHIBITED (0x03 << 0)

#define BM1390GLV_FIFO_DISABLE (0x00 << 7)
#define BM1390GLV_FIFO_ENABLE (0x01 << 7)
#define BM1390GLV_WTM_LEVEL_2 (0x00 << 6)
#define BM1390GLV_WTM_LEVEL_3 (0x01 << 6)
#define BM1390GLV_IIR_MODE_OFF (0x00 << 0)
#define BM1390GLV_IIR_MODE_LOW (0x01 << 0)
#define BM1390GLV_IIR_MODE_MID (0x02 << 0)
#define BM1390GLV_IIR_MODE_HIGH (0x03 << 0)

#define BM1390GLV_FIFO_EMPTY (0x00 << 0)
#define BM1390GLV_FIFO_1 (0x01 << 0)
#define BM1390GLV_FIFO_2 (0x02 << 0)
#define BM1390GLV_FIFO_3 (0x03 << 0)
#define BM1390GLV_FIFO_FULL (0x04 << 0)

#define BM1390GLV_STATUS_REG_RESERVED_WRITE0 (0x00 << 1)
#define BM1390GLV_STATUS_REG_DRDY_NOT_READY (0x00 << 0)
#define BM1390GLV_STATUS_REG_DRDY_READY (0x01 << 0)
 /*registers bit masks */
#define BM1390GLV_ID1_REG_MANUFACTURER_MASK 0xFF
#define BM1390GLV_ID2_REG_MANUFACTURER_MASK 0xFF
#define BM1390GLV_POWER_REG_RESERVED_MASK 0xFE
// Named as PWR_DOWN in specification
#define BM1390GLV_POWER_REG_POWER_MASK 0x01
#define BM1390GLV_RESET_REG_RESERVED_MASK 0xFE
// Named as RESET in specification
#define BM1390GLV_RESET_REG_MODE_MASK 0x01

#define BM1390GLV_MODE_CONTROL_REG_AVE_NUM_MASK 0xE0
// Named as DREN in specification
#define BM1390GLV_MODE_CONTROL_REG_DRDY_MASK 0x10
#define BM1390GLV_MODE_CONTROL_REG_FULL_DRDY_MASK 0x08
#define BM1390GLV_MODE_CONTROL_REG_WTM_DRDY_MASK 0x04
#define BM1390GLV_MODE_CONTROL_REG_MODE_MASK 0x03

#define BM1390GLV_FIFO_EN_MASK 0x80
#define BM1390GLV_WTM_LEVEL_MASK 0x40
#define BM1390GLV_IIR_MODE_MASK 0x03

#define BM1390GLV_FIFO_LEV_MASK 0x07

#define BM1390GLV_STATUS_REG_RESERVED_MASK 0xFE
// Named as RD_DRDY in specification
#define BM1390GLV_STATUS_REG_DRDY_MASK 0x01
#endif

